espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rtclockcali_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** RTCLOCKCALI_LP_CALI_TIMER_REG register
 *  need_des
 */
#define RTCLOCKCALI_LP_CALI_TIMER_REG (DR_REG_RTCLOCKCALI_BASE + 0x0)
/** RTCLOCKCALI_TIMER_TARGET : R/W; bitpos: [29:0]; default: 4095;
 *  need_des
 */
#define RTCLOCKCALI_TIMER_TARGET    0x3FFFFFFFU
#define RTCLOCKCALI_TIMER_TARGET_M  (RTCLOCKCALI_TIMER_TARGET_V << RTCLOCKCALI_TIMER_TARGET_S)
#define RTCLOCKCALI_TIMER_TARGET_V  0x3FFFFFFFU
#define RTCLOCKCALI_TIMER_TARGET_S  0
/** RTCLOCKCALI_TIMER_STOP : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define RTCLOCKCALI_TIMER_STOP    (BIT(30))
#define RTCLOCKCALI_TIMER_STOP_M  (RTCLOCKCALI_TIMER_STOP_V << RTCLOCKCALI_TIMER_STOP_S)
#define RTCLOCKCALI_TIMER_STOP_V  0x00000001U
#define RTCLOCKCALI_TIMER_STOP_S  30
/** RTCLOCKCALI_TIMER_START : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define RTCLOCKCALI_TIMER_START    (BIT(31))
#define RTCLOCKCALI_TIMER_START_M  (RTCLOCKCALI_TIMER_START_V << RTCLOCKCALI_TIMER_START_S)
#define RTCLOCKCALI_TIMER_START_V  0x00000001U
#define RTCLOCKCALI_TIMER_START_S  31

/** RTCLOCKCALI_RTCCALICFG_SLOW_REG register
 *  RTC calibration configure register
 */
#define RTCLOCKCALI_RTCCALICFG_SLOW_REG (DR_REG_RTCLOCKCALI_BASE + 0x4)
/** RTCLOCKCALI_RTC_CALI_START_CYCLING_SLOW : R/W; bitpos: [12]; default: 1;
 *  0: one-shot frequency calculation,1: periodic frequency calculation,
 */
#define RTCLOCKCALI_RTC_CALI_START_CYCLING_SLOW    (BIT(12))
#define RTCLOCKCALI_RTC_CALI_START_CYCLING_SLOW_M  (RTCLOCKCALI_RTC_CALI_START_CYCLING_SLOW_V << RTCLOCKCALI_RTC_CALI_START_CYCLING_SLOW_S)
#define RTCLOCKCALI_RTC_CALI_START_CYCLING_SLOW_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_START_CYCLING_SLOW_S  12
/** RTCLOCKCALI_RTC_CALI_CLK_SEL_SLOW : R/W; bitpos: [14:13]; default: 0;
 *  0:rtc slow clock. 1:clk_8m, 2:xtal_32k.
 */
#define RTCLOCKCALI_RTC_CALI_CLK_SEL_SLOW    0x00000003U
#define RTCLOCKCALI_RTC_CALI_CLK_SEL_SLOW_M  (RTCLOCKCALI_RTC_CALI_CLK_SEL_SLOW_V << RTCLOCKCALI_RTC_CALI_CLK_SEL_SLOW_S)
#define RTCLOCKCALI_RTC_CALI_CLK_SEL_SLOW_V  0x00000003U
#define RTCLOCKCALI_RTC_CALI_CLK_SEL_SLOW_S  13
/** RTCLOCKCALI_RTC_CALI_RDY_SLOW : RO; bitpos: [15]; default: 0;
 *  indicate one-shot frequency calculation is done.
 */
#define RTCLOCKCALI_RTC_CALI_RDY_SLOW    (BIT(15))
#define RTCLOCKCALI_RTC_CALI_RDY_SLOW_M  (RTCLOCKCALI_RTC_CALI_RDY_SLOW_V << RTCLOCKCALI_RTC_CALI_RDY_SLOW_S)
#define RTCLOCKCALI_RTC_CALI_RDY_SLOW_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_RDY_SLOW_S  15
/** RTCLOCKCALI_RTC_CALI_MAX_SLOW : R/W; bitpos: [30:16]; default: 1;
 *  Configure the time to calculate RTC slow clock's frequency.
 */
#define RTCLOCKCALI_RTC_CALI_MAX_SLOW    0x00007FFFU
#define RTCLOCKCALI_RTC_CALI_MAX_SLOW_M  (RTCLOCKCALI_RTC_CALI_MAX_SLOW_V << RTCLOCKCALI_RTC_CALI_MAX_SLOW_S)
#define RTCLOCKCALI_RTC_CALI_MAX_SLOW_V  0x00007FFFU
#define RTCLOCKCALI_RTC_CALI_MAX_SLOW_S  16
/** RTCLOCKCALI_RTC_CALI_START_SLOW : R/W; bitpos: [31]; default: 0;
 *  Set this bit to start one-shot frequency calculation.
 */
#define RTCLOCKCALI_RTC_CALI_START_SLOW    (BIT(31))
#define RTCLOCKCALI_RTC_CALI_START_SLOW_M  (RTCLOCKCALI_RTC_CALI_START_SLOW_V << RTCLOCKCALI_RTC_CALI_START_SLOW_S)
#define RTCLOCKCALI_RTC_CALI_START_SLOW_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_START_SLOW_S  31

/** RTCLOCKCALI_RTCCALICFG_FAST_REG register
 *  RTC calibration configure register
 */
#define RTCLOCKCALI_RTCCALICFG_FAST_REG (DR_REG_RTCLOCKCALI_BASE + 0x8)
/** RTCLOCKCALI_FOSC_DIV_NUM : R/W; bitpos: [11:4]; default: 0;
 *  fosc clock divider number
 */
#define RTCLOCKCALI_FOSC_DIV_NUM    0x000000FFU
#define RTCLOCKCALI_FOSC_DIV_NUM_M  (RTCLOCKCALI_FOSC_DIV_NUM_V << RTCLOCKCALI_FOSC_DIV_NUM_S)
#define RTCLOCKCALI_FOSC_DIV_NUM_V  0x000000FFU
#define RTCLOCKCALI_FOSC_DIV_NUM_S  4
/** RTCLOCKCALI_RTC_CALI_START_CYCLING_FAST : R/W; bitpos: [12]; default: 1;
 *  0: one-shot frequency calculation,1: periodic frequency calculation,
 */
#define RTCLOCKCALI_RTC_CALI_START_CYCLING_FAST    (BIT(12))
#define RTCLOCKCALI_RTC_CALI_START_CYCLING_FAST_M  (RTCLOCKCALI_RTC_CALI_START_CYCLING_FAST_V << RTCLOCKCALI_RTC_CALI_START_CYCLING_FAST_S)
#define RTCLOCKCALI_RTC_CALI_START_CYCLING_FAST_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_START_CYCLING_FAST_S  12
/** RTCLOCKCALI_RTC_CALI_CLK_SEL_FAST : R/W; bitpos: [14:13]; default: 0;
 *  0:rtc slow clock. 1:clk_8m, 2:xtal_32k.
 */
#define RTCLOCKCALI_RTC_CALI_CLK_SEL_FAST    0x00000003U
#define RTCLOCKCALI_RTC_CALI_CLK_SEL_FAST_M  (RTCLOCKCALI_RTC_CALI_CLK_SEL_FAST_V << RTCLOCKCALI_RTC_CALI_CLK_SEL_FAST_S)
#define RTCLOCKCALI_RTC_CALI_CLK_SEL_FAST_V  0x00000003U
#define RTCLOCKCALI_RTC_CALI_CLK_SEL_FAST_S  13
/** RTCLOCKCALI_RTC_CALI_RDY_FAST : RO; bitpos: [15]; default: 0;
 *  indicate one-shot frequency calculation is done.
 */
#define RTCLOCKCALI_RTC_CALI_RDY_FAST    (BIT(15))
#define RTCLOCKCALI_RTC_CALI_RDY_FAST_M  (RTCLOCKCALI_RTC_CALI_RDY_FAST_V << RTCLOCKCALI_RTC_CALI_RDY_FAST_S)
#define RTCLOCKCALI_RTC_CALI_RDY_FAST_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_RDY_FAST_S  15
/** RTCLOCKCALI_RTC_CALI_MAX_FAST : R/W; bitpos: [30:16]; default: 1;
 *  Configure the time to calculate RTC slow clock's frequency.
 */
#define RTCLOCKCALI_RTC_CALI_MAX_FAST    0x00007FFFU
#define RTCLOCKCALI_RTC_CALI_MAX_FAST_M  (RTCLOCKCALI_RTC_CALI_MAX_FAST_V << RTCLOCKCALI_RTC_CALI_MAX_FAST_S)
#define RTCLOCKCALI_RTC_CALI_MAX_FAST_V  0x00007FFFU
#define RTCLOCKCALI_RTC_CALI_MAX_FAST_S  16
/** RTCLOCKCALI_RTC_CALI_START_FAST : R/W; bitpos: [31]; default: 0;
 *  Set this bit to start one-shot frequency calculation.
 */
#define RTCLOCKCALI_RTC_CALI_START_FAST    (BIT(31))
#define RTCLOCKCALI_RTC_CALI_START_FAST_M  (RTCLOCKCALI_RTC_CALI_START_FAST_V << RTCLOCKCALI_RTC_CALI_START_FAST_S)
#define RTCLOCKCALI_RTC_CALI_START_FAST_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_START_FAST_S  31

