espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rtclockcali_reg.h
/** RTCLOCKCALI_RTCCALICFG1_SLOW_REG register
 *  RTC calibration configure1 register
 */
#define RTCLOCKCALI_RTCCALICFG1_SLOW_REG (DR_REG_RTCLOCKCALI_BASE + 0xc)
/** RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_SLOW : RO; bitpos: [0]; default: 0;
 *  indicate periodic frequency calculation is done.
 */
#define RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_SLOW    (BIT(0))
#define RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_SLOW_M  (RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_SLOW_V << RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_SLOW_S)
#define RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_SLOW_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_SLOW_S  0
/** RTCLOCKCALI_RTC_CALI_VALUE_SLOW : RO; bitpos: [31:7]; default: 0;
 *  When one-shot or periodic frequency calculation is done, read this value to
 *  calculate RTC slow clock's frequency.
 */
#define RTCLOCKCALI_RTC_CALI_VALUE_SLOW    0x01FFFFFFU
#define RTCLOCKCALI_RTC_CALI_VALUE_SLOW_M  (RTCLOCKCALI_RTC_CALI_VALUE_SLOW_V << RTCLOCKCALI_RTC_CALI_VALUE_SLOW_S)
#define RTCLOCKCALI_RTC_CALI_VALUE_SLOW_V  0x01FFFFFFU
#define RTCLOCKCALI_RTC_CALI_VALUE_SLOW_S  7

/** RTCLOCKCALI_RTCCALICFG1_FAST_REG register
 *  RTC calibration configure1 register
 */
#define RTCLOCKCALI_RTCCALICFG1_FAST_REG (DR_REG_RTCLOCKCALI_BASE + 0x10)
/** RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_FAST : RO; bitpos: [0]; default: 0;
 *  indicate periodic frequency calculation is done.
 */
#define RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_FAST    (BIT(0))
#define RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_FAST_M  (RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_FAST_V << RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_FAST_S)
#define RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_FAST_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_CYCLING_DATA_VLD_FAST_S  0
/** RTCLOCKCALI_RTC_CALI_VALUE_FAST : RO; bitpos: [31:7]; default: 0;
 *  When one-shot or periodic frequency calculation is done, read this value to
 *  calculate RTC slow clock's frequency.
 */
#define RTCLOCKCALI_RTC_CALI_VALUE_FAST    0x01FFFFFFU
#define RTCLOCKCALI_RTC_CALI_VALUE_FAST_M  (RTCLOCKCALI_RTC_CALI_VALUE_FAST_V << RTCLOCKCALI_RTC_CALI_VALUE_FAST_S)
#define RTCLOCKCALI_RTC_CALI_VALUE_FAST_V  0x01FFFFFFU
#define RTCLOCKCALI_RTC_CALI_VALUE_FAST_S  7

/** RTCLOCKCALI_RTCCALICFG2_REG register
 *  Timer group calibration register
 */
#define RTCLOCKCALI_RTCCALICFG2_REG (DR_REG_RTCLOCKCALI_BASE + 0x14)
/** RTCLOCKCALI_RTC_CALI_TIMEOUT : RO; bitpos: [0]; default: 0;
 *  RTC calibration timeout indicator
 */
#define RTCLOCKCALI_RTC_CALI_TIMEOUT    (BIT(0))
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_M  (RTCLOCKCALI_RTC_CALI_TIMEOUT_V << RTCLOCKCALI_RTC_CALI_TIMEOUT_S)
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_V  0x00000001U
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_S  0
/** RTCLOCKCALI_RTC_CALI_TIMEOUT_RST_CNT : R/W; bitpos: [6:3]; default: 3;
 *  Cycles that release calibration timeout reset
 */
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_RST_CNT    0x0000000FU
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_RST_CNT_M  (RTCLOCKCALI_RTC_CALI_TIMEOUT_RST_CNT_V << RTCLOCKCALI_RTC_CALI_TIMEOUT_RST_CNT_S)
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_RST_CNT_V  0x0000000FU
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_RST_CNT_S  3
/** RTCLOCKCALI_RTC_CALI_TIMEOUT_THRES : R/W; bitpos: [31:7]; default: 33554431;
 *  Threshold value for the RTC calibration timer. If the calibration timer's value
 *  exceeds this threshold, a timeout is triggered.
 */
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_THRES    0x01FFFFFFU
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_THRES_M  (RTCLOCKCALI_RTC_CALI_TIMEOUT_THRES_V << RTCLOCKCALI_RTC_CALI_TIMEOUT_THRES_S)
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_THRES_V  0x01FFFFFFU
#define RTCLOCKCALI_RTC_CALI_TIMEOUT_THRES_S  7

/** RTCLOCKCALI_DFREQ_HIGH_LIMIT_SLOW_REG register
 *  RTC slow clock dfreq high limit.
 */
#define RTCLOCKCALI_DFREQ_HIGH_LIMIT_SLOW_REG (DR_REG_RTCLOCKCALI_BASE + 0x18)
/** RTCLOCKCALI_COARSE_LIMIT_DIFF_SLOW : R/W; bitpos: [7:0]; default: 16;
 *  When rtc_cali_value upper/lower than reg_high/low_limit +/-
 *  reg_coarse_limit_diff,the step of dfreq,will use reg_coarse_step.
 */
#define RTCLOCKCALI_COARSE_LIMIT_DIFF_SLOW    0x000000FFU
#define RTCLOCKCALI_COARSE_LIMIT_DIFF_SLOW_M  (RTCLOCKCALI_COARSE_LIMIT_DIFF_SLOW_V << RTCLOCKCALI_COARSE_LIMIT_DIFF_SLOW_S)
#define RTCLOCKCALI_COARSE_LIMIT_DIFF_SLOW_V  0x000000FFU
#define RTCLOCKCALI_COARSE_LIMIT_DIFF_SLOW_S  0
/** RTCLOCKCALI_HIGH_LIMIT_SLOW : R/W; bitpos: [31:8]; default: 267;
 *  when rtc_cali_value upper than reg_high_limit,frequency of osc will  increase .
 */
#define RTCLOCKCALI_HIGH_LIMIT_SLOW    0x00FFFFFFU
#define RTCLOCKCALI_HIGH_LIMIT_SLOW_M  (RTCLOCKCALI_HIGH_LIMIT_SLOW_V << RTCLOCKCALI_HIGH_LIMIT_SLOW_S)
#define RTCLOCKCALI_HIGH_LIMIT_SLOW_V  0x00FFFFFFU
#define RTCLOCKCALI_HIGH_LIMIT_SLOW_S  8

/** RTCLOCKCALI_DFREQ_LOW_LIMIT_SLOW_REG register
 *  RTC slow clock dfreq low limit.
 */
#define RTCLOCKCALI_DFREQ_LOW_LIMIT_SLOW_REG (DR_REG_RTCLOCKCALI_BASE + 0x1c)
/** RTCLOCKCALI_LOW_LIMIT_SLOW : R/W; bitpos: [31:8]; default: 266;
 *  when rtc_cali_value lower than reg_low_limit,frequency of osc will  decrease .
 */
#define RTCLOCKCALI_LOW_LIMIT_SLOW    0x00FFFFFFU
#define RTCLOCKCALI_LOW_LIMIT_SLOW_M  (RTCLOCKCALI_LOW_LIMIT_SLOW_V << RTCLOCKCALI_LOW_LIMIT_SLOW_S)
#define RTCLOCKCALI_LOW_LIMIT_SLOW_V  0x00FFFFFFU
#define RTCLOCKCALI_LOW_LIMIT_SLOW_S  8

/** RTCLOCKCALI_DFREQ_HIGH_LIMIT_FAST_REG register
 *  RTC fast clock dfreq high limit.
 */
#define RTCLOCKCALI_DFREQ_HIGH_LIMIT_FAST_REG (DR_REG_RTCLOCKCALI_BASE + 0x20)
/** RTCLOCKCALI_COARSE_LIMIT_DIFF_FAST : R/W; bitpos: [7:0]; default: 16;
 *  When rtc_cali_value upper/lower than reg_high/low_limit +/-
 *  reg_coarse_limit_diff,the step of dfreq,will use reg_coarse_step.
 */
#define RTCLOCKCALI_COARSE_LIMIT_DIFF_FAST    0x000000FFU
#define RTCLOCKCALI_COARSE_LIMIT_DIFF_FAST_M  (RTCLOCKCALI_COARSE_LIMIT_DIFF_FAST_V << RTCLOCKCALI_COARSE_LIMIT_DIFF_FAST_S)
#define RTCLOCKCALI_COARSE_LIMIT_DIFF_FAST_V  0x000000FFU
#define RTCLOCKCALI_COARSE_LIMIT_DIFF_FAST_S  0
/** RTCLOCKCALI_HIGH_LIMIT_FAST : R/W; bitpos: [31:8]; default: 267;
 *  when rtc_cali_value upper than reg_high_limit,frequency of osc will  increase .
 */
#define RTCLOCKCALI_HIGH_LIMIT_FAST    0x00FFFFFFU
#define RTCLOCKCALI_HIGH_LIMIT_FAST_M  (RTCLOCKCALI_HIGH_LIMIT_FAST_V << RTCLOCKCALI_HIGH_LIMIT_FAST_S)
#define RTCLOCKCALI_HIGH_LIMIT_FAST_V  0x00FFFFFFU
#define RTCLOCKCALI_HIGH_LIMIT_FAST_S  8

/** RTCLOCKCALI_DFREQ_LOW_LIMIT_FAST_REG register
 *  RTC fast clock dfreq low limit.
 */
#define RTCLOCKCALI_DFREQ_LOW_LIMIT_FAST_REG (DR_REG_RTCLOCKCALI_BASE + 0x24)
/** RTCLOCKCALI_LOW_LIMIT_FAST : R/W; bitpos: [31:8]; default: 266;
 *  when rtc_cali_value lower than reg_low_limit,frequency of osc will  decrease .
 */
#define RTCLOCKCALI_LOW_LIMIT_FAST    0x00FFFFFFU
#define RTCLOCKCALI_LOW_LIMIT_FAST_M  (RTCLOCKCALI_LOW_LIMIT_FAST_V << RTCLOCKCALI_LOW_LIMIT_FAST_S)
#define RTCLOCKCALI_LOW_LIMIT_FAST_V  0x00FFFFFFU
#define RTCLOCKCALI_LOW_LIMIT_FAST_S  8

/** RTCLOCKCALI_DFREQ_CONF2_REG register
 *  RTC DFREQ CONF2
 */
#define RTCLOCKCALI_DFREQ_CONF2_REG (DR_REG_RTCLOCKCALI_BASE + 0x28)
/** RTCLOCKCALI_DREQ_UPDATE : WT; bitpos: [0]; default: 0;
 *  need_des
 */
#define RTCLOCKCALI_DREQ_UPDATE    (BIT(0))
#define RTCLOCKCALI_DREQ_UPDATE_M  (RTCLOCKCALI_DREQ_UPDATE_V << RTCLOCKCALI_DREQ_UPDATE_S)
#define RTCLOCKCALI_DREQ_UPDATE_V  0x00000001U
#define RTCLOCKCALI_DREQ_UPDATE_S  0
/** RTCLOCKCALI_DREQ_INIT_32K : WT; bitpos: [2]; default: 0;
 *  Initialize the value of 32K OSC dfreq setting.
 */
#define RTCLOCKCALI_DREQ_INIT_32K    (BIT(2))
#define RTCLOCKCALI_DREQ_INIT_32K_M  (RTCLOCKCALI_DREQ_INIT_32K_V << RTCLOCKCALI_DREQ_INIT_32K_S)
#define RTCLOCKCALI_DREQ_INIT_32K_V  0x00000001U
#define RTCLOCKCALI_DREQ_INIT_32K_S  2
/** RTCLOCKCALI_DREQ_INIT_FOSC : WT; bitpos: [3]; default: 0;
 *  Initialize the value of FOSC  dfreq setting.
 */
#define RTCLOCKCALI_DREQ_INIT_FOSC    (BIT(3))
#define RTCLOCKCALI_DREQ_INIT_FOSC_M  (RTCLOCKCALI_DREQ_INIT_FOSC_V << RTCLOCKCALI_DREQ_INIT_FOSC_S)
#define RTCLOCKCALI_DREQ_INIT_FOSC_V  0x00000001U
#define RTCLOCKCALI_DREQ_INIT_FOSC_S  3
/** RTCLOCKCALI_DREQ_INIT_SOSC : WT; bitpos: [4]; default: 0;
 *  Initialize the value of SOSC  dfreq setting.
 */
#define RTCLOCKCALI_DREQ_INIT_SOSC    (BIT(4))
#define RTCLOCKCALI_DREQ_INIT_SOSC_M  (RTCLOCKCALI_DREQ_INIT_SOSC_V << RTCLOCKCALI_DREQ_INIT_SOSC_S)
#define RTCLOCKCALI_DREQ_INIT_SOSC_V  0x00000001U
#define RTCLOCKCALI_DREQ_INIT_SOSC_S  4
/** RTCLOCKCALI_32K_DFREQ_SEL : R/W; bitpos: [5]; default: 0;
 *  1:Frequency of 32k controlled by calibration module.0:Frequency of 32k controlled
 *  by register from system-register bank
 */
#define RTCLOCKCALI_32K_DFREQ_SEL    (BIT(5))
#define RTCLOCKCALI_32K_DFREQ_SEL_M  (RTCLOCKCALI_32K_DFREQ_SEL_V << RTCLOCKCALI_32K_DFREQ_SEL_S)
#define RTCLOCKCALI_32K_DFREQ_SEL_V  0x00000001U
#define RTCLOCKCALI_32K_DFREQ_SEL_S  5
/** RTCLOCKCALI_FOSC_DFREQ_SEL : R/W; bitpos: [6]; default: 0;
 *  1:Frequency of FOSC controlled by calibration module.0:Frequency of FOSC controlled
 *  by register from system-register bank
 */
#define RTCLOCKCALI_FOSC_DFREQ_SEL    (BIT(6))
#define RTCLOCKCALI_FOSC_DFREQ_SEL_M  (RTCLOCKCALI_FOSC_DFREQ_SEL_V << RTCLOCKCALI_FOSC_DFREQ_SEL_S)
#define RTCLOCKCALI_FOSC_DFREQ_SEL_V  0x00000001U
#define RTCLOCKCALI_FOSC_DFREQ_SEL_S  6
/** RTCLOCKCALI_SOSC_DFREQ_SEL : R/W; bitpos: [7]; default: 0;
 *  1:Frequency of SOSC controlled by calibration module.0:Frequency of SOSC controlled
 *  by register from system-register bank
 */
#define RTCLOCKCALI_SOSC_DFREQ_SEL    (BIT(7))
#define RTCLOCKCALI_SOSC_DFREQ_SEL_M  (RTCLOCKCALI_SOSC_DFREQ_SEL_V << RTCLOCKCALI_SOSC_DFREQ_SEL_S)
#define RTCLOCKCALI_SOSC_DFREQ_SEL_V  0x00000001U
#define RTCLOCKCALI_SOSC_DFREQ_SEL_S  7
/** RTCLOCKCALI_FINE_STEP : R/W; bitpos: [15:8]; default: 1;
 *  Frequency fine step.
 */
#define RTCLOCKCALI_FINE_STEP    0x000000FFU
#define RTCLOCKCALI_FINE_STEP_M  (RTCLOCKCALI_FINE_STEP_V << RTCLOCKCALI_FINE_STEP_S)
#define RTCLOCKCALI_FINE_STEP_V  0x000000FFU
#define RTCLOCKCALI_FINE_STEP_S  8
/** RTCLOCKCALI_COARSE_STEP_FAST : R/W; bitpos: [23:16]; default: 8;
 *  Frequency coarse step,use to decrease calibration time.
 */
#define RTCLOCKCALI_COARSE_STEP_FAST    0x000000FFU
#define RTCLOCKCALI_COARSE_STEP_FAST_M  (RTCLOCKCALI_COARSE_STEP_FAST_V << RTCLOCKCALI_COARSE_STEP_FAST_S)
#define RTCLOCKCALI_COARSE_STEP_FAST_V  0x000000FFU
#define RTCLOCKCALI_COARSE_STEP_FAST_S  16
/** RTCLOCKCALI_COARSE_STEP_SLOW : R/W; bitpos: [31:24]; default: 8;
 *  Frequency coarse step,use to decrease calibration time.
 */
#define RTCLOCKCALI_COARSE_STEP_SLOW    0x000000FFU
#define RTCLOCKCALI_COARSE_STEP_SLOW_M  (RTCLOCKCALI_COARSE_STEP_SLOW_V << RTCLOCKCALI_COARSE_STEP_SLOW_S)
#define RTCLOCKCALI_COARSE_STEP_SLOW_V  0x000000FFU
#define RTCLOCKCALI_COARSE_STEP_SLOW_S  24

