espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rtclockcali_reg.h
/** RTCLOCKCALI_CALI_EN_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_CALI_EN_REG (DR_REG_RTCLOCKCALI_BASE + 0x2c)
/** RTCLOCKCALI_CALI_EN_32K : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define RTCLOCKCALI_CALI_EN_32K    (BIT(0))
#define RTCLOCKCALI_CALI_EN_32K_M  (RTCLOCKCALI_CALI_EN_32K_V << RTCLOCKCALI_CALI_EN_32K_S)
#define RTCLOCKCALI_CALI_EN_32K_V  0x00000001U
#define RTCLOCKCALI_CALI_EN_32K_S  0
/** RTCLOCKCALI_CALI_EN_FOSC : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define RTCLOCKCALI_CALI_EN_FOSC    (BIT(1))
#define RTCLOCKCALI_CALI_EN_FOSC_M  (RTCLOCKCALI_CALI_EN_FOSC_V << RTCLOCKCALI_CALI_EN_FOSC_S)
#define RTCLOCKCALI_CALI_EN_FOSC_V  0x00000001U
#define RTCLOCKCALI_CALI_EN_FOSC_S  1
/** RTCLOCKCALI_CALI_EN_SOSC : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define RTCLOCKCALI_CALI_EN_SOSC    (BIT(2))
#define RTCLOCKCALI_CALI_EN_SOSC_M  (RTCLOCKCALI_CALI_EN_SOSC_V << RTCLOCKCALI_CALI_EN_SOSC_S)
#define RTCLOCKCALI_CALI_EN_SOSC_V  0x00000001U
#define RTCLOCKCALI_CALI_EN_SOSC_S  2

/** RTCLOCKCALI_DFREQ_VALUE_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_DFREQ_VALUE_REG (DR_REG_RTCLOCKCALI_BASE + 0x30)
/** RTCLOCKCALI_DREQ_32K : RO; bitpos: [11:2]; default: 172;
 *  The value of dfreq num of 32k.
 */
#define RTCLOCKCALI_DREQ_32K    0x000003FFU
#define RTCLOCKCALI_DREQ_32K_M  (RTCLOCKCALI_DREQ_32K_V << RTCLOCKCALI_DREQ_32K_S)
#define RTCLOCKCALI_DREQ_32K_V  0x000003FFU
#define RTCLOCKCALI_DREQ_32K_S  2
/** RTCLOCKCALI_DREQ_FOSC : RO; bitpos: [21:12]; default: 512;
 *  The value of dfreq num of FOSC.
 */
#define RTCLOCKCALI_DREQ_FOSC    0x000003FFU
#define RTCLOCKCALI_DREQ_FOSC_M  (RTCLOCKCALI_DREQ_FOSC_V << RTCLOCKCALI_DREQ_FOSC_S)
#define RTCLOCKCALI_DREQ_FOSC_V  0x000003FFU
#define RTCLOCKCALI_DREQ_FOSC_S  12
/** RTCLOCKCALI_DREQ_SOSC : RO; bitpos: [31:22]; default: 512;
 *  The value of dfreq num of SOSC.
 */
#define RTCLOCKCALI_DREQ_SOSC    0x000003FFU
#define RTCLOCKCALI_DREQ_SOSC_M  (RTCLOCKCALI_DREQ_SOSC_V << RTCLOCKCALI_DREQ_SOSC_S)
#define RTCLOCKCALI_DREQ_SOSC_V  0x000003FFU
#define RTCLOCKCALI_DREQ_SOSC_S  22

/** RTCLOCKCALI_BYPASS_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_BYPASS_REG (DR_REG_RTCLOCKCALI_BASE + 0x34)
/** RTCLOCKCALI_HP_SLEEP_AUTOCALI : R/W; bitpos: [30]; default: 0;
 *  1:Chip begin to calibrating,when into hp_sleep.0:Disable this function.
 */
#define RTCLOCKCALI_HP_SLEEP_AUTOCALI    (BIT(30))
#define RTCLOCKCALI_HP_SLEEP_AUTOCALI_M  (RTCLOCKCALI_HP_SLEEP_AUTOCALI_V << RTCLOCKCALI_HP_SLEEP_AUTOCALI_S)
#define RTCLOCKCALI_HP_SLEEP_AUTOCALI_V  0x00000001U
#define RTCLOCKCALI_HP_SLEEP_AUTOCALI_S  30
/** RTCLOCKCALI_LP_SLEEP_AUTOCALI : R/W; bitpos: [31]; default: 0;
 *  1:Chip begin to calibrating,when into lp_sleep.0:Disable this function.
 */
#define RTCLOCKCALI_LP_SLEEP_AUTOCALI    (BIT(31))
#define RTCLOCKCALI_LP_SLEEP_AUTOCALI_M  (RTCLOCKCALI_LP_SLEEP_AUTOCALI_V << RTCLOCKCALI_LP_SLEEP_AUTOCALI_S)
#define RTCLOCKCALI_LP_SLEEP_AUTOCALI_V  0x00000001U
#define RTCLOCKCALI_LP_SLEEP_AUTOCALI_S  31

/** RTCLOCKCALI_INT_RAW_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_INT_RAW_REG (DR_REG_RTCLOCKCALI_BASE + 0x38)
/** RTCLOCKCALI_XTAL_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [29]; default: 0;
 *  Indicate the xtal timeout  once happened .
 */
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_RAW    (BIT(29))
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_RAW_M  (RTCLOCKCALI_XTAL_TIMEOUT_INT_RAW_V << RTCLOCKCALI_XTAL_TIMEOUT_INT_RAW_S)
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_RAW_V  0x00000001U
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_RAW_S  29
/** RTCLOCKCALI_CALI_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [30]; default: 0;
 *  Indicate the calibration timeout  once happened .
 */
#define RTCLOCKCALI_CALI_TIMEOUT_INT_RAW    (BIT(30))
#define RTCLOCKCALI_CALI_TIMEOUT_INT_RAW_M  (RTCLOCKCALI_CALI_TIMEOUT_INT_RAW_V << RTCLOCKCALI_CALI_TIMEOUT_INT_RAW_S)
#define RTCLOCKCALI_CALI_TIMEOUT_INT_RAW_V  0x00000001U
#define RTCLOCKCALI_CALI_TIMEOUT_INT_RAW_S  30
/** RTCLOCKCALI_CALI_DONE_INT_RAW : R/WTC/SS; bitpos: [31]; default: 0;
 *  Indicate the finish of once calibration .
 */
#define RTCLOCKCALI_CALI_DONE_INT_RAW    (BIT(31))
#define RTCLOCKCALI_CALI_DONE_INT_RAW_M  (RTCLOCKCALI_CALI_DONE_INT_RAW_V << RTCLOCKCALI_CALI_DONE_INT_RAW_S)
#define RTCLOCKCALI_CALI_DONE_INT_RAW_V  0x00000001U
#define RTCLOCKCALI_CALI_DONE_INT_RAW_S  31

/** RTCLOCKCALI_INT_ST_REG register
 *  Interrupt state register.
 */
#define RTCLOCKCALI_INT_ST_REG (DR_REG_RTCLOCKCALI_BASE + 0x3c)
/** RTCLOCKCALI_XTAL_TIMEOUT_INT_ST : RO; bitpos: [29]; default: 0;
 *  Interrupt state register.
 */
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_ST    (BIT(29))
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_ST_M  (RTCLOCKCALI_XTAL_TIMEOUT_INT_ST_V << RTCLOCKCALI_XTAL_TIMEOUT_INT_ST_S)
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_ST_V  0x00000001U
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_ST_S  29
/** RTCLOCKCALI_CALI_TIMEOUT_INT_ST : RO; bitpos: [30]; default: 0;
 *  Interrupt state register.
 */
#define RTCLOCKCALI_CALI_TIMEOUT_INT_ST    (BIT(30))
#define RTCLOCKCALI_CALI_TIMEOUT_INT_ST_M  (RTCLOCKCALI_CALI_TIMEOUT_INT_ST_V << RTCLOCKCALI_CALI_TIMEOUT_INT_ST_S)
#define RTCLOCKCALI_CALI_TIMEOUT_INT_ST_V  0x00000001U
#define RTCLOCKCALI_CALI_TIMEOUT_INT_ST_S  30
/** RTCLOCKCALI_CALI_DONE_INT_ST : RO; bitpos: [31]; default: 0;
 *  Interrupt state register.
 */
#define RTCLOCKCALI_CALI_DONE_INT_ST    (BIT(31))
#define RTCLOCKCALI_CALI_DONE_INT_ST_M  (RTCLOCKCALI_CALI_DONE_INT_ST_V << RTCLOCKCALI_CALI_DONE_INT_ST_S)
#define RTCLOCKCALI_CALI_DONE_INT_ST_V  0x00000001U
#define RTCLOCKCALI_CALI_DONE_INT_ST_S  31

/** RTCLOCKCALI_INT_ENA_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_INT_ENA_REG (DR_REG_RTCLOCKCALI_BASE + 0x40)
/** RTCLOCKCALI_XTAL_TIMEOUT_INT_ENA : R/W; bitpos: [29]; default: 0;
 *  Interrupt enable signal.
 */
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_ENA    (BIT(29))
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_ENA_M  (RTCLOCKCALI_XTAL_TIMEOUT_INT_ENA_V << RTCLOCKCALI_XTAL_TIMEOUT_INT_ENA_S)
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_ENA_V  0x00000001U
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_ENA_S  29
/** RTCLOCKCALI_CALI_TIMEOUT_INT_ENA : R/W; bitpos: [30]; default: 0;
 *  Interrupt enable signal.
 */
#define RTCLOCKCALI_CALI_TIMEOUT_INT_ENA    (BIT(30))
#define RTCLOCKCALI_CALI_TIMEOUT_INT_ENA_M  (RTCLOCKCALI_CALI_TIMEOUT_INT_ENA_V << RTCLOCKCALI_CALI_TIMEOUT_INT_ENA_S)
#define RTCLOCKCALI_CALI_TIMEOUT_INT_ENA_V  0x00000001U
#define RTCLOCKCALI_CALI_TIMEOUT_INT_ENA_S  30
/** RTCLOCKCALI_CALI_DONE_INT_ENA : R/W; bitpos: [31]; default: 0;
 *  Interrupt enable signal.
 */
#define RTCLOCKCALI_CALI_DONE_INT_ENA    (BIT(31))
#define RTCLOCKCALI_CALI_DONE_INT_ENA_M  (RTCLOCKCALI_CALI_DONE_INT_ENA_V << RTCLOCKCALI_CALI_DONE_INT_ENA_S)
#define RTCLOCKCALI_CALI_DONE_INT_ENA_V  0x00000001U
#define RTCLOCKCALI_CALI_DONE_INT_ENA_S  31

/** RTCLOCKCALI_INT_CLR_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_INT_CLR_REG (DR_REG_RTCLOCKCALI_BASE + 0x44)
/** RTCLOCKCALI_XTAL_TIMEOUT_INT_CLR : WT; bitpos: [29]; default: 0;
 *  interrupt clear signal.
 */
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_CLR    (BIT(29))
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_CLR_M  (RTCLOCKCALI_XTAL_TIMEOUT_INT_CLR_V << RTCLOCKCALI_XTAL_TIMEOUT_INT_CLR_S)
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_CLR_V  0x00000001U
#define RTCLOCKCALI_XTAL_TIMEOUT_INT_CLR_S  29
/** RTCLOCKCALI_CALI_TIMEOUT_INT_CLR : WT; bitpos: [30]; default: 0;
 *  interrupt clear signal.
 */
#define RTCLOCKCALI_CALI_TIMEOUT_INT_CLR    (BIT(30))
#define RTCLOCKCALI_CALI_TIMEOUT_INT_CLR_M  (RTCLOCKCALI_CALI_TIMEOUT_INT_CLR_V << RTCLOCKCALI_CALI_TIMEOUT_INT_CLR_S)
#define RTCLOCKCALI_CALI_TIMEOUT_INT_CLR_V  0x00000001U
#define RTCLOCKCALI_CALI_TIMEOUT_INT_CLR_S  30
/** RTCLOCKCALI_CALI_DONE_INT_CLR : WT; bitpos: [31]; default: 0;
 *  interrupt clear signal.
 */
#define RTCLOCKCALI_CALI_DONE_INT_CLR    (BIT(31))
#define RTCLOCKCALI_CALI_DONE_INT_CLR_M  (RTCLOCKCALI_CALI_DONE_INT_CLR_V << RTCLOCKCALI_CALI_DONE_INT_CLR_S)
#define RTCLOCKCALI_CALI_DONE_INT_CLR_V  0x00000001U
#define RTCLOCKCALI_CALI_DONE_INT_CLR_S  31

/** RTCLOCKCALI_TIMEOUT_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_TIMEOUT_REG (DR_REG_RTCLOCKCALI_BASE + 0x48)
/** RTCLOCKCALI_TIMEOUT_TARGET : R/W; bitpos: [29:0]; default: 0;
 *  use to setting max calibration time .
 */
#define RTCLOCKCALI_TIMEOUT_TARGET    0x3FFFFFFFU
#define RTCLOCKCALI_TIMEOUT_TARGET_M  (RTCLOCKCALI_TIMEOUT_TARGET_V << RTCLOCKCALI_TIMEOUT_TARGET_S)
#define RTCLOCKCALI_TIMEOUT_TARGET_V  0x3FFFFFFFU
#define RTCLOCKCALI_TIMEOUT_TARGET_S  0
/** RTCLOCKCALI_TIMEOUT_EN : R/W; bitpos: [31]; default: 0;
 *  use to enable calibration time-out function ,the calibration force stopping,when
 *  timeout.
 */
#define RTCLOCKCALI_TIMEOUT_EN    (BIT(31))
#define RTCLOCKCALI_TIMEOUT_EN_M  (RTCLOCKCALI_TIMEOUT_EN_V << RTCLOCKCALI_TIMEOUT_EN_S)
#define RTCLOCKCALI_TIMEOUT_EN_V  0x00000001U
#define RTCLOCKCALI_TIMEOUT_EN_S  31

/** RTCLOCKCALI_XTAL_TIMEOUT_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_XTAL_TIMEOUT_REG (DR_REG_RTCLOCKCALI_BASE + 0x4c)
/** RTCLOCKCALI_XTAL_TIMEOUT_CNT_TARGET : R/W; bitpos: [29:14]; default: 65535;
 *  use to setting max xtal monitor time .
 */
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_TARGET    0x0000FFFFU
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_TARGET_M  (RTCLOCKCALI_XTAL_TIMEOUT_CNT_TARGET_V << RTCLOCKCALI_XTAL_TIMEOUT_CNT_TARGET_S)
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_TARGET_V  0x0000FFFFU
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_TARGET_S  14
/** RTCLOCKCALI_XTAL_TIMEOUT_CNT_STOP : WT; bitpos: [30]; default: 0;
 *  use to stop XTAL time-out function ,timeout happened when xtal invalid.
 */
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_STOP    (BIT(30))
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_STOP_M  (RTCLOCKCALI_XTAL_TIMEOUT_CNT_STOP_V << RTCLOCKCALI_XTAL_TIMEOUT_CNT_STOP_S)
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_STOP_V  0x00000001U
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_STOP_S  30
/** RTCLOCKCALI_XTAL_TIMEOUT_CNT_START : WT; bitpos: [31]; default: 0;
 *  use to start XTAL time-out function ,timeout happened when xtal invalid.
 */
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_START    (BIT(31))
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_START_M  (RTCLOCKCALI_XTAL_TIMEOUT_CNT_START_V << RTCLOCKCALI_XTAL_TIMEOUT_CNT_START_S)
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_START_V  0x00000001U
#define RTCLOCKCALI_XTAL_TIMEOUT_CNT_START_S  31

/** RTCLOCKCALI_DATE_REG register
 *  Configure register.
 */
#define RTCLOCKCALI_DATE_REG (DR_REG_RTCLOCKCALI_BASE + 0x3fc)
/** RTCLOCKCALI_RTCLOCKCALI_DATE : R/W; bitpos: [30:0]; default: 36708448;
 *  need_des
 */
#define RTCLOCKCALI_RTCLOCKCALI_DATE    0x7FFFFFFFU
#define RTCLOCKCALI_RTCLOCKCALI_DATE_M  (RTCLOCKCALI_RTCLOCKCALI_DATE_V << RTCLOCKCALI_RTCLOCKCALI_DATE_S)
#define RTCLOCKCALI_RTCLOCKCALI_DATE_V  0x7FFFFFFFU
#define RTCLOCKCALI_RTCLOCKCALI_DATE_S  0
/** RTCLOCKCALI_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define RTCLOCKCALI_CLK_EN    (BIT(31))
#define RTCLOCKCALI_CLK_EN_M  (RTCLOCKCALI_CLK_EN_V << RTCLOCKCALI_CLK_EN_S)
#define RTCLOCKCALI_CLK_EN_V  0x00000001U
#define RTCLOCKCALI_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
